000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MULTI-PARAM-FUNCTION.

000300 DATA DIVISION.
000400 LINKAGE SECTION.
000500 01 myInt PIC 9(2).
000600 01 myFloat PIC 9(2)V9(2).

000700 PROCEDURE DIVISION USING myInt, myFloat.
000800     COMPUTE myFloat = myInt + myFloat.
000900     DISPLAY myFloat.
001000     STOP RUN.
